Repository: alt-atomic/atomic-installer
Catalog: po/*.po
Languages: ru

source: Language selection
ru: Выбор языка

source: Device check
ru: Проверка устройства

source: Image selection
ru: Выбор образа

source: Disk selection
ru: Выбор диска

source: Filesystem selection
ru: Выбор файловой системы

source: Bootloader selection
ru: Выбор загрузчика

source: User selection
ru: Создание пользователя

source: Summary
ru: Сводка

source: Installation
ru: Установка

source: Waiting for installation to complete
ru: Ожидание завершения установки

source: Ready
ru: Готово

source: Next
ru: Далее

source: Creating ostree repository
ru: Создание ostree-репозитория

source: Starting installation
ru: Запуск установки

source: Checking required commands and environment
ru: Проверка необходимых команд и окружения

source: Checking temporary directory
ru: Проверка временной директории

source: Preparing disk: cleaning, partitioning
ru: Подготовка диска: очистка, разметка

source: Installing system
ru: Установка системы

source: Configuring system
ru: Настройка системы

source: Finalizing installation, verification and cleanup
ru: Завершение установки, проверка и очистка

source: Installation completed successfully
ru: Установка успешно завершена

source: Installation error
ru: Ошибка установки

source: Unknown status
ru: Неизвестный статус

source: UEFI (recommended for modern systems)
ru: UEFI (рекомендуется для современных систем)

source: LEGACY (compatible variant)
ru: LEGACY (совместимый вариант)

source: LEGACY (UEFI not supported)
ru: LEGACY (UEFI не поддерживается)

source: Your computer supports UEFI boot - this is the recommended choice
ru: Ваш компьютер поддерживает загрузку UEFI - это рекомендуемый выбор

source: UEFI is not supported on this system, use LEGACY
ru: UEFI не поддерживается на этой системе, используйте LEGACY

source: UEFI mode is selected - this is the recommended choice for modern systems
ru: Выбран режим UEFI - это рекомендуемый выбор для современных систем

source: LEGACY is selected - a more compatible option for BIOS/UEFI
ru: Выбран LEGACY - более совместимый вариант для BIOS/UEFI

source: Continue
ru: Продолжить

source: Checking device...
ru: Проверка устройства...

source: Insufficient disk space. At least 60GB required
ru: Недостаточно места на диске. Требуется не менее 60 ГБ

source: The device is ready for installation!
ru: Устройство готово к установке!

source: Check your internet connection
ru: Проверьте подключение к интернету

source: Error getting disk list
ru: Ошибка получения списка дисков

source: Disk size
ru: Размер диска

source: Encrypt disk with LUKS
ru: Зашифровать диск с помощью LUKS

source: LUKS password:
ru: Пароль LUKS:

source: Minimum 4 characters
ru: Минимум 4 символа

source: unknown model
ru: неизвестная модель

source: btrfs - recommended choice, works well with atomic image
ru: btrfs - рекомендуемый выбор, хорошо работает с атомарным образом

source: ext4 - classic, proven file system
ru: ext4 - классическая, проверенная файловая система

source: GNOME Image. Recommended
ru: Образ GNOME. Рекомендуется

source: GNOME image for NVIDIA
ru: Образ GNOME для NVIDIA

source: Error executing command (check that skopeo is installed)
ru: Ошибка выполнения команды (проверьте, установлен ли skopeo)

source: Add your image
ru: Добавить свой образ

source: Enter the image link
ru: Введите ссылку на образ

source: Check and add
ru: Проверить и добавить

source: Enter your image manually and check
ru: Введите образ вручную и проверьте

source: Empty description
ru: Пустое описание

source: Please enter a valid image name
ru: Пожалуйста, введите корректное имя образа

source: Image verification error
ru: Ошибка проверки образа

source: The image has been verified and added to the list
ru: Образ проверен и добавлен в список

source: First check the entered image
ru: Сначала проверьте введенный образ

source: Start installation
ru: Начать установку

source: Cancel
ru: Отмена

source: Are you sure you want to cancel the installation ?
ru: Вы уверены, что хотите отменить установку?

source: No
ru: Нет

source: Yes
ru: Да

source: Restart
ru: Перезагрузка

source: User
ru: Пользователь

source: Password
ru: Пароль

source: Bootloader
ru: Загрузчик

source: Selected image
ru: Выбранный образ

source: System language
ru: Язык системы

source: Selected disk
ru: Выбранный диск

source: Filesystem
ru: Файловая система

source: Disk encryption
ru: Шифрование диска

source: Start install
ru: Начать установку

source: Login
ru: Логин

source: Repeat password
ru: Повторите пароль

source: Username and password cannot be empty.
ru: Имя пользователя и пароль не могут быть пустыми.

source: Passwords do not match. Try again.
ru: Пароли не совпадают. Попробуйте снова.

source: Sorry, this username is already in use. Please try another one.
ru: Извините, это имя пользователя уже занято. Пожалуйста, выберите другое.

source: The username is too long.
ru: Имя пользователя слишком длинное.

source: The username must start with a lowercase letter from a to z.
ru: Имя пользователя должно начинаться со строчной буквы от a до z.

source: Sorry, this username is not available. Please try another one.
ru: Извините, это имя пользователя недоступно. Пожалуйста, выберите другое.

source: The username may only consist of lowercase letters (a-z), digits, and the characters '-' or '_'.
ru: Имя пользователя может состоять только из строчных букв (a-z), цифр и символов '-' или '_'.

source: This username will be used for creating your home directory and cannot be changed.
ru: Это имя пользователя будет использоваться для создания вашей домашней директории и не может быть изменено.
